/*
--D:Процедура по заполнению справочника справочника типов атак
--E: EXEC [dbo].[fill_dim_AttackTypes]
*/


CREATE PROCEDURE [dbo].[fill_dim_AttackTypes]
AS
BEGIN
	--=====================================================================
	--Инициализация логирования:
	--=====================================================================	
	DECLARE  @Name NVARCHAR(MAX) = '['+ OBJECT_SCHEMA_NAME(@@PROCID)+'].['+OBJECT_NAME(@@PROCID)+']'
			,@Description NVARCHAR(512) = 'Заполнение справочника типов атак'
			,@InputParameters NVARCHAR(512) = ''
	BEGIN TRY
		--=====================================================================
		--Запуск логирования:
		--=====================================================================
		EXEC [oth].[fill_SupLog] @Name = @Name,	@StateName = 'start', @SpID = @@SPID, @Description = @Description, @InputParameters  = @InputParameters;
		--=====================================================================
		--Тело процедуры:
		--=====================================================================	

		TRUNCATE TABLE [dbo].[dim_AttackTypes]

		INSERT INTO [dbo].[dim_AttackTypes]
		(
			 [CombinationID]
			,[AttackTypeSign]
			,[AttackTypeDescription]
		)
		VALUES
			(1, 'X7', 'Зона'),
			(1, 'XD', 'Широкий взлёт «от себя»'),
			(1, 'XG', 'Показ «зона», играет взлёт «от себя»'),
			(1, 'XC', 'Взлёт «от себя»'),
			(1, 'XM', 'Приём ближе к 2, атака в 3'),
			(1, 'X1', 'Взлёт на голове'),
			(1, 'X2', 'Взлёт за головой'),
			(1, 'XS', 'Взлёт за головой «от себя»'),
			(1, 'XF', 'Показ взлёт на голове и забег в 2'),
			(1, 'XO', 'Диагональный играет взлёт за головой'),
			(1, 'CB', 'Атака с одной ноги за головой связки'),
			(1, 'CF', 'Атака с одной ноги за головой связки «от себя»'),

			(2, 'X5', 'Быстро в 4'),
			(2, 'X0', 'Быстро в 5'),
			(2, 'X6', 'Быстро в 2'),
			(2, 'X8', 'Быстро в 1 (диагональному на заднюю линию)'),
			(2, 'XP', 'Быстро в 6 (быстрый пайп)'),
			(2, 'XR', 'Быстрый пайп из зоны 5'),
			(2, 'XB', 'Быстрый пайп из зоны 1'),

			(3, 'V5', 'Высоко в 4'),
			(3, 'V0', 'Высоко в 5'),
			(3, 'V6', 'Высоко в 2'),
			(3, 'V8', 'Высоко в 1 (диагональному на заднюю линию)'),
			(3, 'VP', 'Высоко в 6 (высокий пайп)'),
			(3, 'VR', 'Высокий пайп из зоны 5'),
			(3, 'VB', 'Высокий пайп из зоны 1'),

			(4, 'X3', 'Крест'),
			(4, 'XT', 'Вход в зону или волна'),
			(4, 'X4', 'Обратный крест'),
			(4, 'XQ', 'Волна за головой'),
			(4, 'X9', 'Зона над зоной'),

			(5, 'PR', 'Переходящий мяч'),
			(5, 'PP', 'Обман связующим'),
			(5, 'P2', 'Обман нападающего 2 касанием'),
			(5, 'V3', 'Высокий мяч в 3')
		--=====================================================================
		--Завершение логирования c успехом:
		--=====================================================================
	EXEC [oth].[fill_SupLog] @Name = @Name, @StateName = 'finish', @SpID = @@SPID, @Description = @Description, @InputParameters  = @InputParameters;
	END TRY
	
	BEGIN CATCH
		--=====================================================================
		--Завершение логирования c ошибкой:
		--=====================================================================
		EXEC [oth].[fill_SupLog] @Name = @Name, @StateName = 'error', @SpID = @@SPID, @Description = @Description, @InputParameters  = @InputParameters;
	END CATCH
END